[
    {
        "url": "http://books.toscrape.com/catalogue/camp-midnight_886/index.html",
        "review_rating": 4,
        "title": "Camp Midnight",
        "price": "£17.08",
        "category": "Sequential Art",
        "description": "Ben 10 and Big Hero 6 creator Steven T. Seagle returns to comics with New Yorker Magazine cartoonist Jason Adam Katzenstein for a new graphic novel! Reluctant Skye is accidentally sent to the wrong summer camp. Not wanting to please her \"step monster,\" Skye is dead-set on not fitting in. That won't be a problem, as everyone at Camp Midnight-with the exception of fellow cam Ben 10 and Big Hero 6 creator Steven T. Seagle returns to comics with New Yorker Magazine cartoonist Jason Adam Katzenstein for a new graphic novel! Reluctant Skye is accidentally sent to the wrong summer camp. Not wanting to please her \"step monster,\" Skye is dead-set on not fitting in. That won't be a problem, as everyone at Camp Midnight-with the exception of fellow camper and fast-friend Mia-is a full-fledged monster! The perfect book for fans of Raina Telgemeier's \"Smile, \" but wish it had more bowls of gooey eyeballs. ...more",
        "upc": "7b599c8bfcdd8d30",
        "number_of_reviews": 0,
        "availability": "In stock (16 available)",
        "image_url": "http://books.toscrape.com/media/cache/7a/67/7a671ecf69cdcd2ea9ebe85da1b5585f.jpg",
        "price_float": 17.08
    },
    {
        "url": "http://books.toscrape.com/catalogue/codename-baboushka-volume-1-the-conclave-of-death_887/index.html",
        "review_rating": 4,
        "title": "Codename Baboushka, Volume 1: The Conclave of Death",
        "price": "£36.72",
        "category": "Sequential Art",
        "description": "\"What if the sexy Russian femme fatale was actually the main character?\" Mysterious young heiress Contessa Annika Malikova has been part of Manhattan high society for several years... but if they knew the truth, her dinner companions would faint! The white-haired Contessa is in fact the notorious criminal \"BABOUSHKA\" -- a former Moscow gang leader, now living in exile! But \"What if the sexy Russian femme fatale was actually the main character?\" Mysterious young heiress Contessa Annika Malikova has been part of Manhattan high society for several years... but if they knew the truth, her dinner companions would faint! The white-haired Contessa is in fact the notorious criminal \"BABOUSHKA\" -- a former Moscow gang leader, now living in exile! But Baboushka's retirement is about to be shattered, as the US government has somehow discovered her true identity, and blackmails her into working for them! Now she must infiltrate a secret conclave of global crime lords, on a cruise liner, to retrieve information for the Americans. But nobody reckoned on the boat being hijacked by pirates... Suitable for teens and up, CODENAME BABOUSHKA is an action-packed modern pulp spy thriller from writer ANTONY JOHNSTON (THE FUSE, THE COLDEST CITY, ALEX RIDER) and artist SHARI CHANKHAMMA (THE FUSE, SHELTERED, KILL SHAKESPEARE), filled with glamour, guns, exotic locations, guns, explosions, high-kicks, and did we mention guns? \"An ass-kicking spy heroine who will appeal to fans of Marvel's Black Widow.\"- The AV Club \"There are literally six different amazing comics all within this one series\"- Comics Alliance \"Codename Baboushka takes a more female-positive look at the James Bond-esque role. Fun, fast-paced action. Female assassin done right!\"- Dark Side Comics \"Johnston's exiled Russian heiress, former organized crime lord and deadly agent bursts out of the page and grabs the reader with both hands in a deadly grip of hot action and cold-hearted kills.\"- Jersey Journal THE CONCLAVE OF DEATH collects Baboushka's first 5-issue mission -- watch out for her next assignment, GHOST STATION ZERO, in 2016! \"Antony Johnston is an award-winning, New York Times bestselling author of graphic novels, video games, and books. His graphic novel THE COLDEST CITY is being adapted into a film starring Charlize Theron. His epic series WASTELAND is one of only a handful of such longform comic stories in the medium. His first video game, DEAD SPACE, redefined the survival horror genre. ...more",
        "upc": "8754c83ab2a7ae71",
        "number_of_reviews": 0,
        "availability": "In stock (16 available)",
        "image_url": "http://books.toscrape.com/media/cache/ed/a5/eda54d1bfcdd39488013f7aae1eaf659.jpg",
        "price_float": 36.72
    },
    {
        "url": "http://books.toscrape.com/catalogue/danganronpa-volume-1_889/index.html",
        "review_rating": 4,
        "title": "Danganronpa Volume 1",
        "price": "£51.99",
        "category": "Sequential Art",
        "description": "Each year, the elite Hope's Peak Academy selects only the most gifted and talented students to enroll...plus one ordinary student, chosen by lottery. Makoto Naegi was that lucky person--or so he thought! When he shows up for class, he finds the elite students are a bizarre cast of oddballs under the ruthless authority of a robot teddy bear principal, Monokuma. The bear lay Each year, the elite Hope's Peak Academy selects only the most gifted and talented students to enroll...plus one ordinary student, chosen by lottery. Makoto Naegi was that lucky person--or so he thought! When he shows up for class, he finds the elite students are a bizarre cast of oddballs under the ruthless authority of a robot teddy bear principal, Monokuma. The bear lays down the school rules: the only way out of Hope's Peak is to not only murder another student...but get away with it, as every murder is followed by a tribunal where the surviving students cross-examine each other!Inspired by the Danganronpa videogame series and based on the anime of the same name, the Danganropa manga is a quirky, fun, weird, and dynamic take on the high school Battle Royale genre. ...more",
        "upc": "09b6cc87e62c2c58",
        "number_of_reviews": 0,
        "availability": "In stock (16 available)",
        "image_url": "http://books.toscrape.com/media/cache/ce/39/ce3942d9a10b6a17805136ace7c140fa.jpg",
        "price_float": 51.99
    },
    {
        "url": "http://books.toscrape.com/catalogue/giant-days-vol-2-giant-days-5-8_895/index.html",
        "review_rating": 2,
        "title": "Giant Days, Vol. 2 (Giant Days #5-8)",
        "price": "£22.11",
        "category": "Sequential Art",
        "description": "Susan, Esther, and Daisy started at university three weeks ago and became fast friends. Now, away from home for the first time, all three want to reinvent themselves. But in the face of hand-wringing boys, “personal experimentation,” holiday balls, nu-chauvinism, and the willful, unwanted intrusion of “academia,” they may be lucky just to make it to spring alive. Giant Day Susan, Esther, and Daisy started at university three weeks ago and became fast friends. Now, away from home for the first time, all three want to reinvent themselves. But in the face of hand-wringing boys, “personal experimentation,” holiday balls, nu-chauvinism, and the willful, unwanted intrusion of “academia,” they may be lucky just to make it to spring alive. Giant Days , the comedic slice-of-life series from creator John Allison (Bad Machinery, Scary Go Round) and artist Lissa Treiman, has graduated to a second volume. ...more",
        "upc": "f2df3bb043a8abb0",
        "number_of_reviews": 0,
        "availability": "In stock (16 available)",
        "image_url": "http://books.toscrape.com/media/cache/d0/6f/d06ff4e3b9daf93b18bb21f1af19b5eb.jpg",
        "price_float": 22.11
    },
    {
        "url": "http://books.toscrape.com/catalogue/i-am-a-hero-omnibus-volume-1_898/index.html",
        "review_rating": 3,
        "title": "I am a Hero Omnibus Volume 1",
        "price": "£54.63",
        "category": "Sequential Art",
        "description": "The zombie apocalypse has never been more surreal! A mentally unhinged manga artist witnesses the beginning of a zombie outbreak in Tokyo, and he's certain of only two things: he's destined to be the city's hero, and he possesses something very rare in Japan--an actual firearm! Kengo Hanazawa's award-winning series comes to Dark Horse, and this realistically-drawn internat The zombie apocalypse has never been more surreal! A mentally unhinged manga artist witnesses the beginning of a zombie outbreak in Tokyo, and he's certain of only two things: he's destined to be the city's hero, and he possesses something very rare in Japan--an actual firearm! Kengo Hanazawa's award-winning series comes to Dark Horse, and this realistically-drawn international bestseller takes us from initial small battles for survival to a huge, body-horror epidemic that threatens all of humanity! These special omnibus volumes will collect two of the original Japanese books into each Dark Horse edition and include all of the color pages.\"Probably the greatest zombie manga ever.\" --Jason Thompson (Manga: The Complete Guide) ...more",
        "upc": "1c89ae5bb804e4de",
        "number_of_reviews": 0,
        "availability": "In stock (16 available)",
        "image_url": "http://books.toscrape.com/media/cache/f7/4d/f74db5141becf01083abc03c078f4922.jpg",
        "price_float": 54.63
    },
    {
        "url": "http://books.toscrape.com/catalogue/i-hate-fairyland-vol-1-madly-ever-after-i-hate-fairyland-compilations-1-5_899/index.html",
        "review_rating": 2,
        "title": "I Hate Fairyland, Vol. 1: Madly Ever After (I Hate Fairyland (Compilations) #1-5)",
        "price": "£29.17",
        "category": "Sequential Art",
        "description": "From superstar writer and artist Skottie Young (Rocket Raccoon, Wizard of OZ, Fortunately, The Milk), comes the first volume of an all-new series of adventure and mayhem. An Adventure Time/Alice in Wonderland-style epic that smashes it's cute little face against grown-up, Tank Girl/Deadpool-esque violent madness. Follow Gert, a forty year old woman stuck in a six year olds From superstar writer and artist Skottie Young (Rocket Raccoon, Wizard of OZ, Fortunately, The Milk), comes the first volume of an all-new series of adventure and mayhem. An Adventure Time/Alice in Wonderland-style epic that smashes it's cute little face against grown-up, Tank Girl/Deadpool-esque violent madness. Follow Gert, a forty year old woman stuck in a six year olds body who has been stuck in the magical world of Fairyland for nearly thirty years. Join her and her giant battle-axe on a delightfully blood soaked journey to see who will survive the girl who HATES FAIRYLAND. Collecting Issues #1-5 for only $9.99. \"Skottie Young is an Eisner Award-Winning, New York Times Bestselling cartoonist who has been making comics and children's books for over fifteen years. Books such as Rocket Raccoon, the Wizard of Oz graphic novels, Little Marvel and Fortunately, The Milk have made him a fan favorite, critically-aclaimed writer and artist. Jean-Francios Beaulieu is the colorist behind the award-winning Wizard of OZ graphic graphic novels and has worked with Skottie Young for over ten years. Nate Piekos is an award-winning letter and designer who has created some of the industry's most popular fons and has used them to letter comic books for Marvel, DC, Oni Press, Dark Horse and many more.\" ...more",
        "upc": "8d4eefad7a2b3915",
        "number_of_reviews": 0,
        "availability": "In stock (16 available)",
        "image_url": "http://books.toscrape.com/media/cache/58/e2/58e2097169e92a95d973da420ce7cc98.jpg",
        "price_float": 29.17
    },
    {
        "url": "http://books.toscrape.com/catalogue/lumberjanes-vol-3-a-terrible-plan-lumberjanes-9-12_905/index.html",
        "review_rating": 2,
        "title": "Lumberjanes Vol. 3: A Terrible Plan (Lumberjanes #9-12)",
        "price": "£19.92",
        "category": "Sequential Art",
        "description": "This New York Times Bestselling series continues with Jo, April, Mal, Molly, and Ripley as they take on everything that goes bump in the night. From scary stories to magical portals that lead to a land untouched by time, it's definitely not your average summer. (Lumberjanes #9-12)",
        "upc": "57e5a4d515c8ce44",
        "number_of_reviews": 0,
        "availability": "In stock (16 available)",
        "image_url": "http://books.toscrape.com/media/cache/d6/9b/d69b7020c4210e12882ffca0428919a2.jpg",
        "price_float": 19.92
    },
    {
        "url": "http://books.toscrape.com/catalogue/lumberjanes-vol-1-beware-the-kitten-holy-lumberjanes-1-4_906/index.html",
        "review_rating": 3,
        "title": "Lumberjanes, Vol. 1: Beware the Kitten Holy (Lumberjanes #1-4)",
        "price": "£45.61",
        "category": "Sequential Art",
        "description": "FRIENDSHIP TO THE MAX!At Miss Qiunzilla Thiskwin Penniquiqul Thistle Crumpet's camp for hard-core lady-types, things are not what they seem. Three-eyed foxes. Secret caves. Anagrams. Luckily, Jo, April, Mal, Molly, and Ripley are five rad, butt-kicking best pals determined to have an awesome summer together... And they're not gonna let a magical quest or an array of supern FRIENDSHIP TO THE MAX!At Miss Qiunzilla Thiskwin Penniquiqul Thistle Crumpet's camp for hard-core lady-types, things are not what they seem. Three-eyed foxes. Secret caves. Anagrams. Luckily, Jo, April, Mal, Molly, and Ripley are five rad, butt-kicking best pals determined to have an awesome summer together... And they're not gonna let a magical quest or an array of supernatural critters get in their way! The mystery keeps getting bigger, and it all begins here. Collects Lumberjanes No. 1-4. ...more",
        "upc": "b6ee99bcf06fc91f",
        "number_of_reviews": 0,
        "availability": "In stock (16 available)",
        "image_url": "http://books.toscrape.com/media/cache/1c/78/1c78cb31ededc4c662857cf65bd1619d.jpg",
        "price_float": 45.61
    },
    {
        "url": "http://books.toscrape.com/catalogue/lumberjanes-vol-2-friendship-to-the-max-lumberjanes-5-8_907/index.html",
        "review_rating": 2,
        "title": "Lumberjanes, Vol. 2: Friendship to the Max (Lumberjanes #5-8)",
        "price": "£46.91",
        "category": "Sequential Art",
        "description": "What a mystery!Jo, April, Mal, Molly, and Ripley are not your average campers and Miss Qiunzella Thiskwin Penniquiqul Thistle Crumpet's Camp for Hardcore Lady-Types is not your average summer camp. Between the river monsters, magic, and the art of friendship bracelets, this summer is only just beginning. Join the Lumberjanes as they take on raptors and a sibling rivalry th What a mystery!Jo, April, Mal, Molly, and Ripley are not your average campers and Miss Qiunzella Thiskwin Penniquiqul Thistle Crumpet's Camp for Hardcore Lady-Types is not your average summer camp. Between the river monsters, magic, and the art of friendship bracelets, this summer is only just beginning. Join the Lumberjanes as they take on raptors and a sibling rivalry that only myths are made of.This New York Times bestseller and Eisner Award-nominated series is written by awesome all-star Noelle Stevenson and brilliant newcomer Grace Ellis, and illustrated by the tremendously talented Brooke Allen.Lumberjanes, Vol. 2: Friendship to the Max includes issues 5-8 and the first fourteen pages of Giant Days, Vol. 1 by John Allison. ...more",
        "upc": "460089f796fb3f82",
        "number_of_reviews": 0,
        "availability": "In stock (16 available)",
        "image_url": "http://books.toscrape.com/media/cache/67/f8/67f83a06f77d0ff3b06cb8ac04839422.jpg",
        "price_float": 46.91
    },
    {
        "url": "http://books.toscrape.com/catalogue/orange-the-complete-collection-1-orange-the-complete-collection-1_914/index.html",
        "review_rating": 1,
        "title": "orange: The Complete Collection 1 (orange: The Complete Collection #1)",
        "price": "£48.41",
        "category": "Sequential Art",
        "description": "A Plea From the FutureOn the day that Naho begins 11th grade, she recieves a letter from herself ten years in the future. At first, she writes it off as a prank, but as the letter’s predictions come true one by one Naho realizes that the letter might be the real deal. Her future self tells Naho that a new transfer student, a boy named Kakeru, will soon join her class. The A Plea From the FutureOn the day that Naho begins 11th grade, she recieves a letter from herself ten years in the future. At first, she writes it off as a prank, but as the letter’s predictions come true one by one Naho realizes that the letter might be the real deal. Her future self tells Naho that a new transfer student, a boy named Kakeru, will soon join her class. The letter begs Naho to watch over him, saying that only Naho can save Kakeru from a terrible future. Who is this mystery boy, and can Naho save him from his destiny? The heart-wrenching sci-fi romance that has over million copies in print in Japan! ...more",
        "upc": "11809b1d323b3057",
        "number_of_reviews": 0,
        "availability": "In stock (16 available)",
        "image_url": "http://books.toscrape.com/media/cache/33/0b/330bf57e3f2e70548f87d39cb956f7eb.jpg",
        "price_float": 48.41
    },
    {
        "url": "http://books.toscrape.com/catalogue/outcast-vol-1-a-darkness-surrounds-him-outcast-1_915/index.html",
        "review_rating": 4,
        "title": "Outcast, Vol. 1: A Darkness Surrounds Him (Outcast #1)",
        "price": "£15.44",
        "category": "Sequential Art",
        "description": "NEW HORROR SERIES FROM THE WALKING DEAD CREATOR ROBERT KIRKMAN! Kyle Barnes has been plagued by demonic possession all his life and now he needs answers. Unfortunately, what he uncovers along the way could bring about the end of life on Earth as we know it. Collects OUTCAST BY KIRKMAN & AZACETA #1-6.",
        "upc": "889139b8e9c4cb36",
        "number_of_reviews": 0,
        "availability": "In stock (16 available)",
        "image_url": "http://books.toscrape.com/media/cache/0c/8a/0c8ae80b592bc1b4c555d6b29d1cfa28.jpg",
        "price_float": 15.44
    },
    {
        "url": "http://books.toscrape.com/catalogue/patience_916/index.html",
        "review_rating": 3,
        "title": "Patience",
        "price": "£10.16",
        "category": "Sequential Art",
        "description": "Patience is a psychedelic science-fiction love story, veering with uncanny precision from violent destruction to deeply personal tenderness in a way that is both quintessentially “Clowesian” and utterly unique in the author’s body of work. This 180-page, full-color original graphic novel affords Clowes the opportunity to draw some of the most exuberant and breathtaking pag Patience is a psychedelic science-fiction love story, veering with uncanny precision from violent destruction to deeply personal tenderness in a way that is both quintessentially “Clowesian” and utterly unique in the author’s body of work. This 180-page, full-color original graphic novel affords Clowes the opportunity to draw some of the most exuberant and breathtaking pages of his life, and to tell his most suspenseful, surprising and affecting story yet. ...more",
        "upc": "9429b4d59c537af5",
        "number_of_reviews": 0,
        "availability": "In stock (16 available)",
        "image_url": "http://books.toscrape.com/media/cache/71/0c/710cdaa148f10aac35c27bb93b4f532e.jpg",
        "price_float": 10.16
    },
    {
        "url": "http://books.toscrape.com/catalogue/pop-gun-war-volume-1-gift_918/index.html",
        "review_rating": 1,
        "title": "Pop Gun War, Volume 1: Gift",
        "price": "£18.97",
        "category": "Sequential Art",
        "description": "\"Pop Gun War is about childhood, self-discovery, oppression, guilt, dreams, loneliness, whatever. It is more about a feeling you, the reader, get from the story rather than a typical narrative. If you wanted to get literal, it is about an inner city boy, Sinclair, who discovers a pair of discarded angel wings. With these wings, Sinclair flies around the city and gets into \"Pop Gun War is about childhood, self-discovery, oppression, guilt, dreams, loneliness, whatever. It is more about a feeling you, the reader, get from the story rather than a typical narrative. If you wanted to get literal, it is about an inner city boy, Sinclair, who discovers a pair of discarded angel wings. With these wings, Sinclair flies around the city and gets into adventures.\" - Farel Dalrymple, series creator From Publishers Weekly: Collecting the first five issues of Dalrymple's acclaimed comic book series Pop Gun War, this book provides a capsule look at Dalrymple's vision of urban fantasy. Set in New York, his stories follow characters with wings, talking fish, giants, dwarves and other fantastical acquaintances and ideas. At the center of it all is a boy named Sinclair, who acquires a set of wings when a tattooed, disgruntled angel pays to have them cut off. Sinclair, a lonely kid prone to bowties and being teased, sets off on a series of encounters across the city. His older sister, a singer in a rock band, is an inspiration and worry; a homeless man of unknown powers and origins joins him; and a band of youths pursue him. Dalrymple renders this gang of eccentrics and mystics in a loose but realistic pen and ink style highly dynamic and tailor-made for depicting New York's teeming city streets. He has a flair for the dramatic as well scenes of Sinclair flying, or of a giant walking the streets, are genuinely affecting, while seeming completely natural and brings to life a subtle kind of cartoon surrealism. The story meanders a bit, and it's not always clear where it's headed, but the fun of Pop Gun War is in its vivid characters and details. It is a fine debut, reminiscent of DC Comics's Vertigo line, with which it should sit comfortably on bookstores' and adventurous readers' shelves. ...more",
        "upc": "e80f8e518b300dfe",
        "number_of_reviews": 0,
        "availability": "In stock (16 available)",
        "image_url": "http://books.toscrape.com/media/cache/6f/7b/6f7b3b8445b943f4ff7426360daefb88.jpg",
        "price_float": 18.97
    },
    {
        "url": "http://books.toscrape.com/catalogue/princess-jellyfish-2-in-1-omnibus-vol-01-princess-jellyfish-2-in-1-omnibus-1_920/index.html",
        "review_rating": 5,
        "title": "Princess Jellyfish 2-in-1 Omnibus, Vol. 01 (Princess Jellyfish 2-in-1 Omnibus #1)",
        "price": "£13.61",
        "category": "Sequential Art",
        "description": "THE LONG-AWAITED STORY OF FANGIRLS TAKING ON TOKYO!Special large-size 2-in-1 edition of over 400 pages!\"One of the best anime and manga for beginners. Enthusiasm - geeky and otherwise - is power in Princess Jellyfish. Enthusiasm saves the day and paves the road to the future.\" - Kotaku\"Princess Jellyfish's ambition is simple: to tell a delightful story in a delightful way. THE LONG-AWAITED STORY OF FANGIRLS TAKING ON TOKYO!Special large-size 2-in-1 edition of over 400 pages!\"One of the best anime and manga for beginners. Enthusiasm - geeky and otherwise - is power in Princess Jellyfish. Enthusiasm saves the day and paves the road to the future.\" - Kotaku\"Princess Jellyfish's ambition is simple: to tell a delightful story in a delightful way... It's a pretty deadly one-two punch.\" - Anime News Network\"Loaded with heart, soul, humor and insight.\" - About.comSTINGING BEAUTY Tsukimi Kurashita has a strange fascination with jellyfish. She’s loved them from a young age and has carried that love with her to her new life in the big city of Tokyo. There, she resides in Amamizukan, a safe-haven for girl geeks who regularly gush over a range of things from trains to Japanese dolls. However, a chance meeting at a pet shop has Tsukimi crossing paths with one of the things that the residents of Amamizukan have been desperately trying to avoid—a beautiful and fashionable woman! But there’s much more to this woman than her trendy clothes! This odd encounter is only the beginning of a new and unexpected path for Tsukimi and her friends. ...more",
        "upc": "0fa6dceead7ce47a",
        "number_of_reviews": 0,
        "availability": "In stock (16 available)",
        "image_url": "http://books.toscrape.com/media/cache/6c/8f/6c8ffe949fb650ba60eff25be1692881.jpg",
        "price_float": 13.61
    },
    {
        "url": "http://books.toscrape.com/catalogue/rat-queens-vol-3-demons-rat-queens-collected-editions-11-15_921/index.html",
        "review_rating": 3,
        "title": "Rat Queens, Vol. 3: Demons (Rat Queens (Collected Editions) #11-15)",
        "price": "£50.40",
        "category": "Sequential Art",
        "description": "Having survived the end of the world, the Queens follow Hannah back to where it all began: Mage University. A long perilous journey awaits the Rat Queens as they attempt to find out what happened to Hannah's father while battling their own demons. Collects RAT QUEENS #11-15",
        "upc": "c82a3e358c773c73",
        "number_of_reviews": 0,
        "availability": "In stock (16 available)",
        "image_url": "http://books.toscrape.com/media/cache/d5/d0/d5d015a9cf899301cce5d1a629bdd974.jpg",
        "price_float": 50.4
    },
    {
        "url": "http://books.toscrape.com/catalogue/saga-volume-5-saga-collected-editions-5_923/index.html",
        "review_rating": 2,
        "title": "Saga, Volume 5 (Saga (Collected Editions) #5)",
        "price": "£51.04",
        "category": "Sequential Art",
        "description": "Multiple storylines collide in this cosmos-spanning new volume. While Gwendolyn and Lying Cat risk everything to find a cure for The Will, Marko makes an uneasy alliance with Prince Robot IV to find their missing children, who are trapped on a strange world with terrifying new enemies. Collects Saga #25-30.",
        "upc": "53a3d11bb568cc8b",
        "number_of_reviews": 0,
        "availability": "In stock (16 available)",
        "image_url": "http://books.toscrape.com/media/cache/60/3c/603c8f3dd299efe67616a53e5bfb1d03.jpg",
        "price_float": 51.04
    },
    {
        "url": "http://books.toscrape.com/catalogue/roller-girl_540/index.html",
        "review_rating": 5,
        "title": "Roller Girl",
        "price": "£14.10",
        "category": "Sequential Art",
        "description": "For fans of Raina Telgemeier’s Smile, a heartwarming graphic novel about friendship and surviving junior high through the power of roller derby. Twelve-year-old Astrid has always done everything with her best friend Nicole. So when Astrid signs up for roller derby camp, she assumes Nicole will too. But Nicole signs up for dance camp with a new friend instead, and so begins For fans of Raina Telgemeier’s Smile, a heartwarming graphic novel about friendship and surviving junior high through the power of roller derby. Twelve-year-old Astrid has always done everything with her best friend Nicole. So when Astrid signs up for roller derby camp, she assumes Nicole will too. But Nicole signs up for dance camp with a new friend instead, and so begins the toughest summer of Astrid's life. There are bumps and bruises as Astrid learns who she is without Nicole...and what it takes to be a strong, tough roller girl. ...more",
        "upc": "aeb51dfbe8aeec59",
        "number_of_reviews": 0,
        "availability": "In stock (8 available)",
        "image_url": "http://books.toscrape.com/media/cache/cf/cf/cfcfb88039ddab7d4ae399246529e401.jpg",
        "price_float": 14.1
    },
    {
        "url": "http://books.toscrape.com/catalogue/fruits-basket-vol-9-fruits-basket-9_563/index.html",
        "review_rating": 4,
        "title": "Fruits Basket, Vol. 9 (Fruits Basket #9)",
        "price": "£33.95",
        "category": "Sequential Art",
        "description": "Finally - summer has arrived! While Tohru struggles through bipolar days of hope and anxiety, what will happen when Yuki comes face-to-face with the new member of the student council? Meanwhile, who is that Uo-chan's hanging out with? Is she c-r-a-z-y in love? In a bonus feature, Hana-chan's past is finally disclosed!",
        "upc": "97187f5cf0385da3",
        "number_of_reviews": 0,
        "availability": "In stock (9 available)",
        "image_url": "http://books.toscrape.com/media/cache/3f/97/3f97ab9d27352e8dd24671c945b1c5ac.jpg",
        "price_float": 33.95
    },
    {
        "url": "http://books.toscrape.com/catalogue/adulthood-is-a-myth-a-sarahs-scribbles-collection_659/index.html",
        "review_rating": 2,
        "title": "Adulthood Is a Myth: A \"Sarah's Scribbles\" Collection",
        "price": "£10.90",
        "category": "Sequential Art",
        "description": "Are you a special snowflake? Do you enjoy networking to advance your career? Is adulthood an exciting new challenge for which you feel fully prepared? Ugh. Please go away.This book is for the rest of us. These comic document the wasting of entire beautiful weekends on the internet, the unbearable agony of holding hands on the street with a gorgeous guy, dreaming all day of Are you a special snowflake? Do you enjoy networking to advance your career? Is adulthood an exciting new challenge for which you feel fully prepared? Ugh. Please go away.This book is for the rest of us. These comic document the wasting of entire beautiful weekends on the internet, the unbearable agony of holding hands on the street with a gorgeous guy, dreaming all day of getting home and back into pajamas, and wondering when, exactly, this adulthood thing begins. In other words, the horrors and awkwardnesses of young modern life. ...more",
        "upc": "5319169a72714c62",
        "number_of_reviews": 0,
        "availability": "In stock (14 available)",
        "image_url": "http://books.toscrape.com/media/cache/bd/b8/bdb8adf93cb0a6778930ccd543dd9b37.jpg",
        "price_float": 10.9
    },
    {
        "url": "http://books.toscrape.com/catalogue/art-ops-vol-1_664/index.html",
        "review_rating": 3,
        "title": "Art Ops Vol. 1",
        "price": "£48.80",
        "category": "Sequential Art",
        "description": "Reggie Riot is no one’s idea of a cultural savior. The latchkey child of a busy single mother, he’s grown up to be a resentful slacker whose idea of high culture is getting stoned and admiring the graffiti in the alley where he scores his weed. His mother, however, is not your average working parent. She’s the head of a secret organization called Art Ops, whose mission i Reggie Riot is no one’s idea of a cultural savior. The latchkey child of a busy single mother, he’s grown up to be a resentful slacker whose idea of high culture is getting stoned and admiring the graffiti in the alley where he scores his weed.   His mother, however, is not your average working parent. She’s the head of a secret organization called Art Ops, whose mission is protecting the artistic treasures of the world—which have a lot more life in them than a casual observer might realize.   Reggie has always shunned his mom’s high-culture scene, but a devastating encounter with the shadowy forces menacing the world’s masterpieces has left him with a permanent expression of the chaotic power of art flowing through his very veins.   So when Art Ops itself suddenly vanishes without a trace, leaving its final rescue—La Gioconda, the Mona Lisa herself—out in the cold, it’s up to Reggie and his motley crew—including a masked super-powered operative who writes sitcom scripts on spec, a girls-just-wanna-have-fun ’80s music-video icon, and a suburban clerk from a mall-punk clothing chain—to come to the rescue.   But do they have what it takes to stand up to the dark side of human creativity?   From writer Shaun Simon (co-author of The True Lives of the Fabulous Killjoys with My Chemical Romance’s Gerard Way) and artists Michael Allred (co-creator of iZOMBIE) and Matt Brundage (The Spirit: The New Adventures) comes ART OPS VOL. 1: HOW TO START A RIOT, collecting issues #1-5 of the ongoing VERTIGO series and featuring a special sketchbook section from Allred and Brundage. ...more",
        "upc": "ffdc825785c0ede8",
        "number_of_reviews": 0,
        "availability": "In stock (14 available)",
        "image_url": "http://books.toscrape.com/media/cache/36/36/3636bc73e33a70300d8265667373d622.jpg",
        "price_float": 48.8
    },
    {
        "url": "http://books.toscrape.com/catalogue/batman-europa_668/index.html",
        "review_rating": 2,
        "title": "Batman: Europa",
        "price": "£32.01",
        "category": "Sequential Art",
        "description": "The long-awaited 4-issue miniseries is collected in a new hardcover! The impossible has happened and Batman is on the verge of being taken down by an enemy he cannot defeat: a virus for which there is no cure! And the only hope for his salvation is The Joker! Who infected Batman, what does the Clown Prince of Crime know, and how will the Dark Knight get that information? T The long-awaited 4-issue miniseries is collected in a new hardcover! The impossible has happened and Batman is on the verge of being taken down by an enemy he cannot defeat: a virus for which there is no cure! And the only hope for his salvation is  The Joker! Who infected Batman, what does the Clown Prince of Crime know, and how will the Dark Knight get that information? Together, the enemies crisscross Europe, desperate to find answers before time runs out. ...more",
        "upc": "bf68dcb5fad3cc8c",
        "number_of_reviews": 0,
        "availability": "In stock (14 available)",
        "image_url": "http://books.toscrape.com/media/cache/dc/f7/dcf7314eb8526366ae9179d1f94bc78e.jpg",
        "price_float": 32.01
    },
    {
        "url": "http://books.toscrape.com/catalogue/el-deafo_691/index.html",
        "review_rating": 5,
        "title": "El Deafo",
        "price": "£57.62",
        "category": "Sequential Art",
        "description": "Starting at a new school is scary, even more so with a giant hearing aid strapped to your chest! At her old school, everyone in Cece's class was deaf. Here she is different. She is sure the kids are staring at the Phonic Ear, the powerful aid that will help her hear her teacher. Too bad it also seems certain to repel potential friends. Then Cece makes a startling discovery Starting at a new school is scary, even more so with a giant hearing aid strapped to your chest! At her old school, everyone in Cece's class was deaf. Here she is different. She is sure the kids are staring at the Phonic Ear, the powerful aid that will help her hear her teacher. Too bad it also seems certain to repel potential friends. Then Cece makes a startling discovery. With the Phonic Ear she can hear her teacher not just in the classroom, but anywhere her teacher is in school--in the hallway...in the teacher's lounge...in the bathroom! This is power. Maybe even superpower! Cece is on her way to becoming El Deafo, Listener for All. But the funny thing about being a superhero is that it's just another way of feeling different... and lonely. Can Cece channel her powers into finding the thing she wants most, a true friend?This funny perceptive graphic novel memoir about growing up hearing impaired is also an unforgettable book about growing up, and all the super and super embarrassing moments along the way. ...more",
        "upc": "27c5968fe43cc06e",
        "number_of_reviews": 0,
        "availability": "In stock (14 available)",
        "image_url": "http://books.toscrape.com/media/cache/95/4b/954b63f24b0e4c1c5ce494b33f694b73.jpg",
        "price_float": 57.62
    },
    {
        "url": "http://books.toscrape.com/catalogue/lowriders-to-the-center-of-the-earth-lowriders-in-space-2_712/index.html",
        "review_rating": 2,
        "title": "Lowriders to the Center of the Earth (Lowriders in Space #2)",
        "price": "£51.51",
        "category": "Sequential Art",
        "description": "The lovable trio from the acclaimed Lowriders in Space are back! Lupe Impala, Elirio Malaria, and El Chavo Octopus are living their dream at last. They're the proud owners of their very own garage. But when their beloved cat Genie goes missing, they need to do everything they can to find him. Little do they know the trail will lead them to the realm of Mictlantecuhtli, the The lovable trio from the acclaimed Lowriders in Space are back! Lupe Impala, Elirio Malaria, and El Chavo Octopus are living their dream at last. They're the proud owners of their very own garage. But when their beloved cat Genie goes missing, they need to do everything they can to find him. Little do they know the trail will lead them to the realm of Mictlantecuhtli, the Aztec god of the Underworld, who is keeping Genie prisoner! With cool Spanish phrases on every page, a glossary of terms, and an action-packed plot that sneaks in science as well as Aztec lore, Lowriders to the Center of the Earth is a linguistic and visual delight. ¡Que suave! ...more",
        "upc": "a10c7515834240f3",
        "number_of_reviews": 0,
        "availability": "In stock (14 available)",
        "image_url": "http://books.toscrape.com/media/cache/30/d0/30d033fe3d7be21522498ce2b30d58d6.jpg",
        "price_float": 51.51
    },
    {
        "url": "http://books.toscrape.com/catalogue/naruto-3-in-1-edition-vol-14-includes-vols-40-41-42-naruto-omnibus-14_721/index.html",
        "review_rating": 2,
        "title": "Naruto (3-in-1 Edition), Vol. 14: Includes Vols. 40, 41 & 42 (Naruto: Omnibus #14)",
        "price": "£38.39",
        "category": "Sequential Art",
        "description": "Naruto is a young shinobi with an incorrigible knack for mischief. He’s got a wild sense of humor, but Naruto is completely serious about his mission to be the world’s greatest ninja!It’s Deidara vs. Sasuke, but even Deidara’s Ultimate Art may be no match for the all-powerful new Sasuke. The battle culminates in a giant explosion, leaving members of Team Kakashi concerned, Naruto is a young shinobi with an incorrigible knack for mischief. He’s got a wild sense of humor, but Naruto is completely serious about his mission to be the world’s greatest ninja!It’s Deidara vs. Sasuke, but even Deidara’s Ultimate Art may be no match for the all-powerful new Sasuke. The battle culminates in a giant explosion, leaving members of Team Kakashi concerned, especially when Karin cannot sense Sasuke’s chakra. Plus, deep inside the Land of Rain lies an Akatsuki secret that sheds doubt on the organization’s true intentions, as well as their mysterious leader, Pain. ...more",
        "upc": "71e36f33981ddb74",
        "number_of_reviews": 0,
        "availability": "In stock (14 available)",
        "image_url": "http://books.toscrape.com/media/cache/0b/b8/0bb8bd42d6b58c7966ba67472a55f905.jpg",
        "price_float": 38.39
    },
    {
        "url": "http://books.toscrape.com/catalogue/red-hoodarsenal-vol-1-open-for-business-red-hoodarsenal-1_729/index.html",
        "review_rating": 2,
        "title": "Red Hood/Arsenal, Vol. 1: Open for Business (Red Hood/Arsenal #1)",
        "price": "£25.48",
        "category": "Sequential Art",
        "description": "Red Hood and Arsenal are open for business! After working for the mysterious Tara Battleworth as on-staff outlaws, Roy and Jason have decided to branch out on their own as freelance problem solvers, investigators, and general butt-kicking specialists. But when the sinister corporate scourge of Underbelly rears its ugly head, can our heroes overcome pure evil and corruption Red Hood and Arsenal are open for business! After working for the mysterious Tara Battleworth as on-staff outlaws, Roy and Jason have decided to branch out on their own as freelance problem solvers, investigators, and general butt-kicking specialists. But when the sinister corporate scourge of Underbelly rears its ugly head, can our heroes overcome pure evil and corruption made manifest? Collects RED HOOD/ARSENAL #1-6. ...more",
        "upc": "31e2e2d9cca3778f",
        "number_of_reviews": 0,
        "availability": "In stock (14 available)",
        "image_url": "http://books.toscrape.com/media/cache/7a/23/7a2319e460168eff8d91828ff380849c.jpg",
        "price_float": 25.48
    },
    {
        "url": "http://books.toscrape.com/catalogue/robin-war_730/index.html",
        "review_rating": 3,
        "title": "Robin War",
        "price": "£47.82",
        "category": "Sequential Art",
        "description": "It’s Robins vs. cops! Robins vs. Robins! Robins vs. Batman! Robins vs. the Court of Owls‽Collecting: Robin War 1-2, Grayson 15, Detective Comics 47, We Are Robin... 7, Robin: Son of Batman 7, Gotham Academy 13, Red Hood/Arsenal 7, & Teen Titans 15",
        "upc": "85b2176b3b194030",
        "number_of_reviews": 0,
        "availability": "In stock (14 available)",
        "image_url": "http://books.toscrape.com/media/cache/08/e3/08e3fff11713d162620c920a2574e149.jpg",
        "price_float": 47.82
    },
    {
        "url": "http://books.toscrape.com/catalogue/so-cute-it-hurts-vol-6-so-cute-it-hurts-6_734/index.html",
        "review_rating": 4,
        "title": "So Cute It Hurts!!, Vol. 6 (So Cute It Hurts!! #6)",
        "price": "£35.43",
        "category": "Sequential Art",
        "description": "The Kobayashi twins, Megumu and Mitsuru, were named after historical figures, but only Megumu has grown up with a taste for history. So when Mitsuru is in danger of losing his weekends to extra history classes, he convinces his sister to swap clothes with him and ace his tests! After all, how hard can it be for them to play each other?Megumu is considering a career as a ma The Kobayashi twins, Megumu and Mitsuru, were named after historical figures, but only Megumu has grown up with a taste for history. So when Mitsuru is in danger of losing his weekends to extra history classes, he convinces his sister to swap clothes with him and ace his tests! After all, how hard can it be for them to play each other?Megumu is considering a career as a manga artist, but as Mitsuru so helpfully points out, her drawing skills could use a lot of improvement. That doesn’t dim her enthusiasm, and she vows to practice drawing every day. But her first sketching session in a park is interrupted by an intense young man who goes ballistic when he sees the portrait of Aoi in her sketchbook! Who is this stranger, and why does he want to destroy her boyfriend?! ...more",
        "upc": "394f6d30cafc3edb",
        "number_of_reviews": 0,
        "availability": "In stock (14 available)",
        "image_url": "http://books.toscrape.com/media/cache/53/ea/53ead08572cc44510da38edf559722d1.jpg",
        "price_float": 35.43
    },
    {
        "url": "http://books.toscrape.com/catalogue/superman-vol-1-before-truth-superman-by-gene-luen-yang-1_739/index.html",
        "review_rating": 5,
        "title": "Superman Vol. 1: Before Truth (Superman by Gene Luen Yang #1)",
        "price": "£11.89",
        "category": "Sequential Art",
        "description": "Superman is going through some changes. First, there's his new \"solar flare\" power, which releases tremendous amounts of energy but leaves him functionally human - fragile, vulnerable, prone to hangovers - for 24 hours.But an even bigger change is coming. A new company called Hordr has sprung up, and its business is secrets. If you have one that you want to keep hidden, Hr Superman is going through some changes. First, there's his new \"solar flare\" power, which releases tremendous amounts of energy but leaves him functionally human - fragile, vulnerable, prone to hangovers - for 24 hours.But an even bigger change is coming. A new company called Hordr has sprung up, and its business is secrets. If you have one that you want to keep hidden, Hrdr can control you - and no one has a bigger secret than Clark Kent.Now, Hordr is threatening to expose Clark's alter ego unless he does everything they command. Will Superman play into the hands of blackmailers to keep his loved ones out of danger? And if the truth that Superman has been hiding is exposed, will it set him free - or ruin his life?A new era for the Man of Steel begins here - crafted by National Book Award nominee Gene Luen Yang (American Born Chinese) and legendary artists John Romita Jr. (Kick-Ass, The Amazing Spider-Man) and Klaus Janson (BATMAN: THE DARK KNIGHT RETURNS). Collects issues #40-44 and the 8-page Superman story from DIVERGENCE: FCBD SPECIAL EDITION #1. ...more",
        "upc": "ac8e3949d284e9a9",
        "number_of_reviews": 0,
        "availability": "In stock (14 available)",
        "image_url": "http://books.toscrape.com/media/cache/31/32/3132ce8535ec612bf8588a5bc62998d4.jpg",
        "price_float": 11.89
    },
    {
        "url": "http://books.toscrape.com/catalogue/through-the-woods_772/index.html",
        "review_rating": 2,
        "title": "Through the Woods",
        "price": "£25.38",
        "category": "Sequential Art",
        "description": "'It came from the woods. Most strange things do.'Five mysterious, spine-tingling stories follow journeys into (and out of?) the eerie abyss.These chilling tales spring from the macabre imagination of acclaimed and award-winning comic creator Emily Carroll.Come take a walk in the woods and see what awaits you there...",
        "upc": "6e44bcbeac7f4360",
        "number_of_reviews": 0,
        "availability": "In stock (14 available)",
        "image_url": "http://books.toscrape.com/media/cache/ac/07/ac07aa5cfd42e6192bb801a749263bba.jpg",
        "price_float": 25.38
    },
    {
        "url": "http://books.toscrape.com/catalogue/we-are-robin-vol-1-the-vigilante-business-we-are-robin-1_778/index.html",
        "review_rating": 1,
        "title": "We Are Robin, Vol. 1: The Vigilante Business (We Are Robin #1)",
        "price": "£53.90",
        "category": "Sequential Art",
        "description": "The teenagers of Gotham City have adopted the “R” and made it their own. A new Robin? No, hundreds of new Robins! The Boy Wonder has inspired a movement in Gotham, where different people of all creeds, colors, genders and religions have donned the “R” insignia to combat crime. But will this clean up the city...or make more trouble for everyone? Collecting WE ARE ROBIN #1-6 The teenagers of Gotham City have adopted the “R” and made it their own. A new Robin? No, hundreds of new Robins! The Boy Wonder has inspired a movement in Gotham, where different people of all creeds, colors, genders and religions have donned the “R” insignia to combat crime. But will this clean up the city...or make more trouble for everyone? Collecting WE ARE ROBIN #1-6 and the sneak peek story from CONVERGENCE: NEW TEEN TITANS #2! ...more",
        "upc": "92275cedf6d8ee15",
        "number_of_reviews": 0,
        "availability": "In stock (14 available)",
        "image_url": "http://books.toscrape.com/media/cache/3e/61/3e611e2228ffe66b05f202cd3da0359c.jpg",
        "price_float": 53.9
    },
    {
        "url": "http://books.toscrape.com/catalogue/wonder-woman-earth-one-volume-one-wonder-woman-earth-one-1_783/index.html",
        "review_rating": 4,
        "title": "Wonder Woman: Earth One, Volume One (Wonder Woman: Earth One #1)",
        "price": "£37.34",
        "category": "Sequential Art",
        "description": "Following the New York Times #1 bestselling original graphic novels Batman: Earth One, Volume One and Superman: Earth One Volumes One and Two comes Wonder Woman: Earth One, Volume One!Critically acclaimed, best-selling writer Grant Morrison (All-Star Superman, Batman, Inc.) once again pushes the boundaries of the graphic novel page in his mind-bending new take on the most Following the New York Times #1 bestselling original graphic novels Batman: Earth One, Volume One and Superman: Earth One Volumes One and Two comes Wonder Woman: Earth One, Volume One!Critically acclaimed, best-selling writer Grant Morrison (All-Star Superman, Batman, Inc.) once again pushes the boundaries of the graphic novel page in his mind-bending new take on the most powerful woman in the DC Universe. With stunning art by Yanick Paquette (Swamp Thing), Wonder Woman: Earth One, Volume One is an easily accessible jumping on point for new readers. ...more",
        "upc": "047097293bb4d1c0",
        "number_of_reviews": 0,
        "availability": "In stock (14 available)",
        "image_url": "http://books.toscrape.com/media/cache/b6/6a/b66a733a0fd2c0ed2cffaf5d2d9dd146.jpg",
        "price_float": 37.34
    },
    {
        "url": "http://books.toscrape.com/catalogue/batman-the-dark-knight-returns-batman_792/index.html",
        "review_rating": 5,
        "title": "Batman: The Dark Knight Returns (Batman)",
        "price": "£15.38",
        "category": "Sequential Art",
        "description": "This masterpiece of modern comics storytelling brings to vivid life a dark world and an even darker man. Together with inker Klaus Janson and colorist Lynn Varley, writer/artist Frank Miller completely reinvents the legend of Batman in his saga of a near-future Gotham City gone to rot, ten years after the Dark Knight's retirement. Crime runs rampant in the streets, and the This masterpiece of modern comics storytelling brings to vivid life a dark world and an even darker man. Together with inker Klaus Janson and colorist Lynn Varley, writer/artist Frank Miller completely reinvents the legend of Batman in his saga of a near-future Gotham City gone to rot, ten years after the Dark Knight's retirement. Crime runs rampant in the streets, and the man who was Batman is still tortured by the memories of his parents' murders. As civil society crumbles around him, Bruce Wayne's long-suppressed vigilante side finally breaks free of its self-imposed shackles. The Dark Knight returns in a blaze of fury, taking on a whole new generation of criminals and matching their level of violence. He is soon joined by this generation's Robin — a girl named Carrie Kelley, who proves to be just as invaluable as her predecessors.But can Batman and Robin deal with the threat posed by their deadliest enemies, after years of incarceration have made them into perfect psychopaths? And more important, can anyone survive the coming fallout of an undeclared war between the superpowers - or a clash of what were once the world's greatest superheroes?Over fifteen years after its debut, 'Batman: The Dark Knight Returns' remains an undisputed classic and one of the most influential stories ever told in the comics medium.Collecting BATMAN: THE DARK KNIGHT RETURNS #1-4 ...more",
        "upc": "47271d8e08b5d31c",
        "number_of_reviews": 0,
        "availability": "In stock (15 available)",
        "image_url": "http://books.toscrape.com/media/cache/1e/38/1e381319aaf7cf69c27a5171520d53fe.jpg",
        "price_float": 15.38
    },
    {
        "url": "http://books.toscrape.com/catalogue/batman-the-long-halloween-batman_793/index.html",
        "review_rating": 2,
        "title": "Batman: The Long Halloween (Batman)",
        "price": "£36.50",
        "category": "Sequential Art",
        "description": "Taking place during Batman's early days of crime fighting, this new edition of the classic mystery tells the story of a mysterious killer who murders his prey only on holidays. Working with District Attorney Harvey Dent and Lieutenant James Gordon, Batman races against the calendar as he tries to discover who Holiday is before he claims his next victim each month. A myster Taking place during Batman's early days of crime fighting, this new edition of the classic mystery tells the story of a mysterious killer who murders his prey only on holidays. Working with District Attorney Harvey Dent and Lieutenant James Gordon, Batman races against the calendar as he tries to discover who Holiday is before he claims his next victim each month. A mystery that has the reader continually guessing the identity of the killer, this story also ties into the events that transform Harvey Dent into Batman's deadly enemy, Two-Face.This edition includes original 13-issue series as well as four additional story pages cut from the original series, which are presented fully colored and restored to their place in the story.  Also featured are sketches and an introduction by the director and writer of The Dark Knight Rises, Christopher Nolan and David Goyer. ...more",
        "upc": "7edc0527cf782e19",
        "number_of_reviews": 0,
        "availability": "In stock (15 available)",
        "image_url": "http://books.toscrape.com/media/cache/26/a6/26a6c3227af69348c542bc4e094279a4.jpg",
        "price_float": 36.5
    },
    {
        "url": "http://books.toscrape.com/catalogue/fables-vol-1-legends-in-exile-fables-1_806/index.html",
        "review_rating": 4,
        "title": "Fables, Vol. 1: Legends in Exile (Fables #1)",
        "price": "£41.62",
        "category": "Sequential Art",
        "description": "When a savage creature known only as the Adversary conquered the fabled lands of legends and fairy tales, all of the infamous inhabitants of folklore were forced into exile. Disguised among the normal citizens of modern-day New York, these magical characters have created their own peaceful and secret society within an exclusive luxury apartment building called Fabletown. B When a savage creature known only as the Adversary conquered the fabled lands of legends and fairy tales, all of the infamous inhabitants of folklore were forced into exile. Disguised among the normal citizens of modern-day New York, these magical characters have created their own peaceful and secret society within an exclusive luxury apartment building called Fabletown. But when Snow White's party-girl sister, Rose Red, is apparently murdered, it is up to Fabletown's sheriff, a reformed and pardoned Big Bad Wolf (Bigby Wolf), to determine if the killer is Bluebeard, Rose's ex-lover and notorious wife killer, or Jack, her current live-in boyfriend and former beanstalk-climber.Collecting FABLES #1-5. ...more",
        "upc": "65d034adf80834b7",
        "number_of_reviews": 0,
        "availability": "In stock (15 available)",
        "image_url": "http://books.toscrape.com/media/cache/51/e4/51e472da0b7be65921345af6d4ca9e51.jpg",
        "price_float": 41.62
    },
    {
        "url": "http://books.toscrape.com/catalogue/the-shadow-hero-the-shadow-hero_860/index.html",
        "review_rating": 1,
        "title": "The Shadow Hero (The Shadow Hero)",
        "price": "£33.14",
        "category": "Sequential Art",
        "description": "A VIBRANT HOMAGE TO A CLASSIC COMIC FROM TWO MASTERS OF THE MODERN GRAPHIC NOVEL. The Shadow Hero is based on golden-age comic series The Green Turtle, whose hero solved crimes and fought injustice just like any other comics hero. But this mysterious masked crusader was hiding more than your run-of-the-mill secret identity...The Green Turtle was the first Asian American su A VIBRANT HOMAGE TO A CLASSIC COMIC FROM TWO MASTERS OF THE MODERN GRAPHIC NOVEL. The Shadow Hero is based on golden-age comic series The Green Turtle, whose hero solved crimes and fought injustice just like any other comics hero. But this mysterious masked crusader was hiding more than your run-of-the-mill secret identity...The Green Turtle was the first Asian American superhero.Now, exactly seventy years later, New York Times-bestselling author Gene Luen Yang has revived this nearly forgotten, pioneering character in a new graphic novel that creates an origin story for the golden-age Green Turtle. With artwork by the unmatched Sonny Liew, this hilarious and insightful graphic novel about heroism and heritage is also a loving tribute to the long, rich tradition of American superhero comics. ...more",
        "upc": "d6361d16212664ed",
        "number_of_reviews": 0,
        "availability": "In stock (15 available)",
        "image_url": "http://books.toscrape.com/media/cache/c3/d2/c3d2356443efca9bcad78eba8d249fc1.jpg",
        "price_float": 33.14
    },
    {
        "url": "http://books.toscrape.com/catalogue/bitch-planet-vol-1-extraordinary-machine-bitch-planet-collected-editions_882/index.html",
        "review_rating": 2,
        "title": "Bitch Planet, Vol. 1: Extraordinary Machine (Bitch Planet (Collected Editions))",
        "price": "£37.92",
        "category": "Sequential Art",
        "description": "Eisner Award-nominated writer Kelly Sue DeConnick (Pretty Deadly, Captain Marvel) and Valentine De Landro (X-Factor) team up to bring you the premiere volume of Bitch Planet, a deliciously vicious riff on women-in-prison sci-fi exploitation.In a future just a few years down the road in the wrong direction, a woman's failure to comply with her patriarchal overlords will res Eisner Award-nominated writer Kelly Sue DeConnick (Pretty Deadly, Captain Marvel) and Valentine De Landro (X-Factor) team up to bring you the premiere volume of Bitch Planet, a deliciously vicious riff on women-in-prison sci-fi exploitation.In a future just a few years down the road in the wrong direction, a woman's failure to comply with her patriarchal overlords will result in exile to the meanest penal planet in the galaxy. When the newest crop of fresh femmes arrive, can they work together to stay alive or will hidden agendas, crooked guards, and the deadliest sport on (or off!) Earth take them to their maker?Collects BITCH PLANET #1-5. ...more",
        "upc": "bdf415fd484ea8a7",
        "number_of_reviews": 0,
        "availability": "In stock (16 available)",
        "image_url": "http://books.toscrape.com/media/cache/9d/1d/9d1d68362670066b155936e37d61bc5b.jpg",
        "price_float": 37.92
    },
    {
        "url": "http://books.toscrape.com/catalogue/the-nameless-city-the-nameless-city-1_940/index.html",
        "review_rating": 4,
        "title": "The Nameless City (The Nameless City #1)",
        "price": "£38.16",
        "category": "Sequential Art",
        "description": "Every nation that invades the City gives it a new name. But before long, new invaders arrive and the City changes hands once again. The natives don't let themselves get caught up in the unending wars. To them, their home is the Nameless City, and those who try to name it are forever outsiders.Kaidu is one such outsider. He's a Dao born and bred--a member of the latest occu Every nation that invades the City gives it a new name. But before long, new invaders arrive and the City changes hands once again. The natives don't let themselves get caught up in the unending wars. To them, their home is the Nameless City, and those who try to name it are forever outsiders.Kaidu is one such outsider. He's a Dao born and bred--a member of the latest occupying nation. Rat is a native of the Nameless City. At first, she hates Kai for everything he stands for, but his love of his new home may be the one thing that can bring these two unlikely friends together. Let's hope so, because the fate of the Nameless City rests in their hands. ...more",
        "upc": "7d385d34d12e60ff",
        "number_of_reviews": 0,
        "availability": "In stock (16 available)",
        "image_url": "http://books.toscrape.com/media/cache/19/de/19deee0778c2406da04a4dd0ea09188f.jpg",
        "price_float": 38.16
    },
    {
        "url": "http://books.toscrape.com/catalogue/this-one-summer_947/index.html",
        "review_rating": 4,
        "title": "This One Summer",
        "price": "£19.49",
        "category": "Sequential Art",
        "description": "Every summer, Rose goes with her mom and dad to a lake house in Awago Beach. It's their getaway, their refuge. Rosie's friend Windy is always there, too, like the little sister she never had. But this summer is different. Rose's mom and dad won't stop fighting, and when Rose and Windy seek a distraction from the drama, they find themselves with a whole new set of problems. Every summer, Rose goes with her mom and dad to a lake house in Awago Beach. It's their getaway, their refuge. Rosie's friend Windy is always there, too, like the little sister she never had. But this summer is different. Rose's mom and dad won't stop fighting, and when Rose and Windy seek a distraction from the drama, they find themselves with a whole new set of problems. It's a summer of secrets and sorrow and growing up, and it's a good thing Rose and Windy have each other.In This One Summer two stellar creators redefine the teen graphic novel. Cousins Mariko and Jillian Tamaki, the team behind Skim, have collaborated on this gorgeous, heartbreaking, and ultimately hopeful story about a girl on the cusp of her teen age — a story of renewal and revelation. ...more",
        "upc": "51653ef291ab7ddc",
        "number_of_reviews": 0,
        "availability": "In stock (16 available)",
        "image_url": "http://books.toscrape.com/media/cache/ee/43/ee4364a59d66bafb1b3264419ab3ed9e.jpg",
        "price_float": 19.49
    },
    {
        "url": "http://books.toscrape.com/catalogue/tsubasa-world-chronicle-2-tsubasa-world-chronicle-2_949/index.html",
        "review_rating": 1,
        "title": "Tsubasa: WoRLD CHRoNiCLE 2 (Tsubasa WoRLD CHRoNiCLE #2)",
        "price": "£16.28",
        "category": "Sequential Art",
        "description": "DUAL WORLDS, DUAL SIGHTS In the land of Nirai Kanai, there are two realms, one that is the \"outside\" world, and another that is \"inside\" and hidden from the rest of reality. At the request of the holy Himegami, Syaoran ventures into this inside realm to investigate an anomaly, but what he sees there is very different from what Fai and Kurogane see. What does this discrepa DUAL WORLDS, DUAL SIGHTS   In the land of Nirai Kanai, there are two realms, one that is the \"outside\" world, and another that is \"inside\" and hidden from the rest of reality. At the request of the holy Himegami, Syaoran ventures into this inside realm to investigate an anomaly, but what he sees there is very different from what Fai and Kurogane see. What does this discrepancy mean, and what can they do to overcome it?! ...more",
        "upc": "09555be379ad9253",
        "number_of_reviews": 0,
        "availability": "In stock (16 available)",
        "image_url": "http://books.toscrape.com/media/cache/8b/ab/8bab133ec9f8248a8d5f5ea5c09d0f56.jpg",
        "price_float": 16.28
    },
    {
        "url": "http://books.toscrape.com/catalogue/scott-pilgrims-precious-little-life-scott-pilgrim-1_987/index.html",
        "review_rating": 5,
        "title": "Scott Pilgrim's Precious Little Life (Scott Pilgrim #1)",
        "price": "£52.29",
        "category": "Sequential Art",
        "description": "Scott Pilgrim's life is totally sweet. He's 23 years old, he's in a rockband, he's \"between jobs\" and he's dating a cute high school girl. Nothing could possibly go wrong, unless a seriously mind-blowing, dangerously fashionable, rollerblading delivery girl named Ramona Flowers starts cruising through his dreams and sailing by him at parties. Will Scott's awesome life get Scott Pilgrim's life is totally sweet. He's 23 years old, he's in a rockband, he's \"between jobs\" and he's dating a cute high school girl. Nothing could possibly go wrong, unless a seriously mind-blowing, dangerously fashionable, rollerblading delivery girl named Ramona Flowers starts cruising through his dreams and sailing by him at parties. Will Scott's awesome life get turned upside-down? Will he have to face Ramona's seven evil ex-boyfriends in battle? The short answer is yes. The long answer is Scott Pilgrim, Volume 1: Scott Pilgrim's Precious Little Life ...more",
        "upc": "3b1c02bac2a429e6",
        "number_of_reviews": 0,
        "availability": "In stock (19 available)",
        "image_url": "http://books.toscrape.com/media/cache/97/27/97275841c81e66d53bf9313cba06f23e.jpg",
        "price_float": 52.29
    },
    {
        "category_name": "Sequential Art"
    }
]